from Pbxbot.core.clients import Pbxbot
from Pbxbot.core.config import Config, Symbols
from Pbxbot.core.database import db
from Pbxbot.plugins.help import BotHelp

# ================= START MESSAGE =================

START_MSG = """
**┌────── ˹ ɪɴғᴏʀᴍᴀᴛɪᴏɴ ˼ ⏤͟͟͞͞‌‌‌‌★**
**┆◍ ʜᴇʏ, ɪ ᴀᴍ : [Oᴡɴ Usᴇʀʙᴏᴛ](https://t.me/OwnUserbot)**
**┆● ɴɪᴄᴇ ᴛᴏ ᴍᴇᴇᴛ ʏᴏᴜ !**
**└──────────────────•**
**➻ ᴀ ғᴀsᴛ & ᴘᴏᴡᴇʀғᴜʟ ᴛᴇʟᴇɢʀᴀᴍ ɪᴅ ᴜsᴇʀ ʙᴏᴛ ᴡɪᴛʜ sᴏᴍᴇ ᴀᴡᴇsᴏᴍᴇ ғᴇᴀᴛᴜʀᴇs.**
**•── ⋅ ⋅ ⋅ ────── ⋅ ⋅ ────── ⋅ ⋅ ⋅ ──•**
**❖ ʏᴏᴜ ᴄᴀɴ ᴜsᴇ ᴍᴇ ғᴏʀ ғᴜɴ ʀᴀɪᴅ sᴘᴀᴍ.**
**❖ ɪ ᴄᴀɴ ʙᴏᴏsᴛ ʏᴏᴜʀ ɪᴅ ᴡɪᴛʜ ᴀɴɪᴍᴀᴛɪᴏɴ**
**•── ⋅ ⋅ ⋅ ────── ⋅ ⋅ ────── ⋅ ⋅ ⋅ ──•**
**๏ ᴄʟɪᴄᴋ ᴏɴ ᴛʜᴇ ʜᴇʟᴘ ʙᴜᴛᴛᴏɴ ᴛᴏ ɢᴇᴛ ɪɴғᴏʀᴍᴀᴛɪᴏɴ ᴀʙᴏᴜᴛ ᴍʏ ᴍᴏᴅᴜʟᴇs ᴀɴᴅ ᴄᴏᴍᴍᴀɴᴅs.**
"""


# ================= HELP MESSAGE =================

HELP_MSG = """
**✦ ᴀᴠᴀɪʟᴀʙʟᴇ ᴄᴏᴍᴍᴀɴᴅꜱ**

**➻ /start - ꜱᴛᴀʀᴛ ᴛʜᴇ ʙᴏᴛ**  
**➻ /session - ᴛᴏ ɢᴇɴᴇʀᴀᴛᴇ sᴇssɪᴏɴ**
**• ᴛʜᴇɴ sᴇʟᴇᴄᴛ - ᴀᴅᴅ ɴᴇᴡ sᴇssɪᴏɴ 📟**
**• .help - ᴀғᴛᴇʀ ᴀᴅᴅɪɴɢ sᴇssɪᴏɴ ʏᴏᴜ ᴄᴀɴ ɢᴇᴛ ᴀʟʟ ᴜsᴇʀʙᴏᴛ ᴀᴠᴀɪʟᴀʙʟᴇ ᴄᴏᴍᴍᴀɴᴅ ʙʏ sᴇɴᴅɪɴɢ .help ɪɴ ᴀɴʏ ᴄʜᴀᴛ ᴏʀ ᴅᴍ.**
---

**✦ ᴀʙᴏᴜᴛ ᴛʜɪꜱ ʙᴏᴛ**
**◍ ᴛᴇʟᴇɢʀᴀᴍ ʙᴏᴛ ᴛᴏ ʙᴏᴏꜱᴛ ʏᴏᴜʀ ɪᴅ ᴡɪᴛʜ ʙᴇᴀᴜᴛɪꜰᴜʟ ᴀɴɪᴍᴀᴛɪᴏɴ.**
**◍ ꜱᴜᴘᴘᴏʀᴛᴇᴅ :- ʀᴇᴘʟʏ-ʀᴀɪᴅ, ɪᴅ-ᴄʟᴏɴᴇ, ʀᴀɪᴅ, ꜱᴘᴀᴍ, ᴜꜱᴇʀ-ᴛᴀɢɢᴇʀ ᴇᴛᴄ.**
**• ᴀɴʏ ɪssᴜᴇs ᴄᴏɴᴛᴀᴄᴛ ᴜs :**

**◌ ᴘᴏᴡᴇʀᴇᴅ ʙʏ : [ᴋᴀɪsᴇɴ-ʙσᴛs](https://t.me/kaisenbots)**  
**◌ ᴅᴇᴠᴇʟᴏᴘᴇʀ : [ᴋ ᴀ ɪ s ᴇ ɴ](https://t.me/kaisenbots)**
"""
